### 📖 Terraform Plan (infra-pe/resources/uat) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cgn_pe_fe.azurerm_cdn_frontdoor_endpoint.this will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "io-u-itn-cgn-pe-frontend-assets-fde-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_origin.this will be created
  + resource "azurerm_cdn_frontdoor_origin" "this" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = "iouitncgnpeassetsst01.z38.web.core.windows.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "io-u-itn-cgn-pe-frontend-assets-fdo-01"
      + origin_host_header             = "iouitncgnpeassetsst01.z38.web.core.windows.net"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_origin_group.this will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "io-u-itn-cgn-pe-frontend-assets-fdog-01"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_route.this will be created
  + resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "io-u-itn-cgn-pe-frontend-assets-cdnr-01"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "IgnoreQueryString"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_custom_domain.this["portal.cgnonboardingportal-uat.pagopa.it"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "portal.cgnonboardingportal-uat.pagopa.it"
      + id                       = (known after apply)
      + name                     = "portal-cgnonboardingportal-uat-pagopa-it"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_custom_domain_association.this["portal.cgnonboardingportal-uat.pagopa.it"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "this" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_endpoint.this will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "io-u-itn-cgn-pe-frontend-fde-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_origin.this["storage"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "this" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = "iouitncgnpefest01.z38.web.core.windows.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "io-u-itn-cgn-pe-frontend-storage-fdo-01"
      + origin_host_header             = "iouitncgnpefest01.z38.web.core.windows.net"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_origin_group.this will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "io-u-itn-cgn-pe-frontend-fdog-01"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_profile.this will be created
  + resource "azurerm_cdn_frontdoor_profile" "this" {
      + id                       = (known after apply)
      + name                     = "io-u-itn-cgn-pe-frontend-afd-01"
      + resource_group_name      = "io-u-itn-cgn-pe-rg-01"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_route.this will be created
  + resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + cdn_frontdoor_rule_set_ids      = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "io-u-itn-cgn-pe-frontend-cdnr-01"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "IgnoreQueryString"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_rule_set.this will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "ruleset"
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_dns_cname_record.this["portal.cgnonboardingportal-uat.pagopa.it"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "portal"
      + resource_group_name = "cgnonboardingportal-u-public-rg"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + target_resource_id  = (known after apply)
      + ttl                 = 3600
      + zone_name           = "cgnonboardingportal-uat.pagopa.it"
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_dns_txt_record.validation["portal.cgnonboardingportal-uat.pagopa.it"] will be created
  + resource "azurerm_dns_txt_record" "validation" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal"
      + resource_group_name = "cgnonboardingportal-u-public-rg"
      + tags                = {
          + "Cdn"            = "io-u-itn-cgn-pe-frontend-afd-01"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Origin"         = "portal.cgnonboardingportal-uat.pagopa.it"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + ttl                 = 3600
      + zone_name           = "cgnonboardingportal-uat.pagopa.it"

      + record {
          + value = (known after apply)
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server.this will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "this" {
        id                                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-u-itn-cgn-pe-postgresql-psql-01"
        name                              = "io-u-itn-cgn-pe-postgresql-psql-01"
      ~ tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_postgres_server"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.5" -> "1.0.7"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.postgre_pep[0] will be updated in-place
  # (moved from module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.postgre_pep)
  ~ resource "azurerm_private_endpoint" "postgre_pep" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-cgn-pe-postgresql-psql-pep-01"
        name                          = "io-u-itn-cgn-pe-postgresql-psql-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_postgres_server"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.5" -> "1.0.7"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 14 to add, 2 to change, 0 to destroy.
```

</details>
